# for elem in "Hiiya":
#     if elem == "i":
#         pass
#     print(elem, end = ", ") # покажет все слово



# Псевдокод для вывода чисел от 1 до 5 (включительно)
# для числа от 1 до 6:
#     вывести число


# for num in range 1-6
#     print num


# my_str = "hello"
# del my_str[0] # нельзя удалить ЧАСТЬ строки


# #         012345678
# my_str = "Linkin park"
# my_str[8] = P
# 1 - буква не в кавычках
# 2 - строку нельзя изменить




# def info(): # обьявление функции
#     print("Hiya")
# info()


# def greet(name): # один параметр
#     """Приветсвует человека, чье имя указано"""
#     print(f"Добро пожаловать {name}!")
# greet("Farrad") # один аргумент


# print(greet.__doc__) # команда для вывода документации


# name = "hey"
# print(name)



# def add(num, num2): # параметры
#     print(f"Сумма чисел num и num2 равна {num+num2}")
# add(5,4) # аргументы
# add(9,4)
# add(5,15)
# add(5123123235,44564564564)

# name = "Farrad"
# print("Добро пожаловать " + name)
# print("Добро пожаловать", name)
# print(f"Добро пожаловать {name}")
# print("Добро пожаловать name")





# def my_function(fname, lname):
#     print(fname, lname)
#
# name = input("введите имя: ")
# name2 = input("введите имя: ")
# my_function(name, name2)





# Создайте функцию, БЕЗ параметров
# Которая выводит ваше имя
# def info(): # обьявление функции
#     print("Farrad")
# info() # вызов функции



# def hello(name):
#     """Функция приветствует человека, чье имя введено"""
#     print(f"Добро пожаловать {name}!")
#
# check = int(input("Сколько студентов приветствовать? "))
# for i in range(check):
#     hello(input("введите имя: "))



# def sub(num1, num2): # Пример функции разности чисел
#     print(num1 - num2)
# sub(10, 2)

# Написать функцию square(side), которая принимает сторону
# квадрата, и выводит его площадь

# def square(side):
#     print("площадь равна:", side ** 2)
#     print("Периметр равен:", (side+side)*2)
# square(8)

