# x = 'Привет мир!'
# print(x)

# Как поставить комментарии
# Ctrl + /
# Если у вас Mac, то Command + /

# y = 7
# print(y)

# Примеры разных переменных
# x = 123
# # y = "hello"
# # z = 3.14
# # print(x, y, z)

# \n - это начало новой линии в тексте
# print("Hello \nthere")

# Пример с сложением
# print(5 + 5)

# Проверка арифметических операторов
# print(10//3) # деление без остатка
# print(10 % 3) # остаток от деления
# print(10 * 3) # умножение
# print(12345 ** 1234) # Степень (умножить число на себя сколько-то раз)


# x = 5
# y = 123
# print(x == y) # Равен ли x - y
# print(10 != 6) # 10 НЕ равно 6
# print(3 > 2) # 3 больше 2
# print(7 < 10) # 7 меньше 10
# print(5 >= 4) # 5 либо больше, либо равно 4
# print(4 <= 5) # 4 либо меньше, либо равно 5