# x = 4
# x = "4" # можно узнать длину
# print("4" + "4") # ставит их рядом
# print(4 + 4) # складывает числа


# if "hey" == "Hey":
#     print("da")
# else:
#     print("no")

# Просмотр теста, вопрос 1
# x = 100
# print(x)

# вопрос 2
# my_list = []
# my_list2 = []
# print(id(my_list))
# print(id(my_list2))

# вопрос 3
# var = 15
# _a = 10
# print(var, _a)

# print("5" + "5" + "5") # 5 + 5 + 5
# print("5" * 3) # одно и тоже

# print(5 + "5") # числа и текст нельзя сложить






# код на питоне
# if 5 > 4:
#     print("hey")

# пример базового псевдокода
# Если 5 больше, чем 4,
    # тогда покажите "hey"


# if 5 > 4:
#     pass # для избежания ошибки, или для пропуска


# word = "hello"
# word = list(word) # создает список, с отдельными элементами строки
# print(word)

# my_list = ["проснуться", "поесть", "пойти на учебу"]
# delo = my_list.pop(0) # удаляет из списка, и хранит значение в переменной
# print(delo)
# print(my_list)

# #          0       1      2      3     4
# my_list = ["hey", "my", "name", "is", "Alex"]
# print(my_list.pop(4)) # выведет Alex


# my_set = {1,1,1,2,2,2,3,3,3} # дубликаты в сетах удаляются
# print(my_set)


# my_list = [] # списки обознаются квадратными скобками
# my_tuple = () # кортежи обозначаются круглыми скобками

# Вопрос 17
# if 2 > 3:
#     print("hey")
# elif 2 == 3:
#     print("hiya")
# else: # ловит все оставшиеся условия
#     print("hello")


# Вопрос 18
# x = 10
# y = "10"
# print(type(x))
# print(type(y))



# if 5 > 4:
# print("hey") # без отступа print не работает



# заполните список любыми 4 именами
# Через команду pop, вытащите одно имя, и добавьте
# в новый список (через команду append)
#           0       1       2          3
# names = ["Alex", "Farrad", "Vika", "Alina"]
# students = []
# one = names.pop(0) # забирает из списка names, имя на 0 индексе
# students.append(one) # добавляет элемент из переменной
# print(students)
# print(names)


# Напишите программу, которая считает возраст
# из списка, и если возраст меньше 18, скажите нельзя,
# Если больше, скажите можно
# ages = [12,18]
# print(ages[0]) # считывает число на 0 индексе
# if ages[0] <= 18 and ages[1] <= 18:
#     print("nope")
# else:
#     print("yup")


